[
  {
    "id": "product_prada_1",
    "sellerId": "seller_1",
    "title": "Prada - Prada Green & Black Striped Canvas Crossbody/Shoulder Bag with Leather Trim - Shoulder bag",
    "description": "Prada Green & Black Striped Canvas Crossbody/Shoulder Bag with Leather Trim\n\nThis chic Prada shoulder bag perfectly balances casual functionality with timeless luxury. Crafted in Italy, the piece is made from durable green and black striped canvas, accented with natural tan leather trim and gold-tone hardware for a refined contrast. The structured flap is secured with a magnetic snap closure and features a distinctive front leather tab embossed with the Prada logo. The back is adorned with Prada’s signature triangular leather logo plaque, further emphasizing authenticity and prestige.\n\nThe bag comes with a detachable and adjustable black fabric shoulder strap (not original strap), allowing versatile wear as a crossbody or shoulder bag. Its compact rectangular silhouette is ideal for carrying everyday essentials in style. Inside, the beige suede-lined interior reveals a well-organized layout with a zipped pocket and slip compartment, finished with leather detailing and the Prada Milano logo plaque.\n\nCondition:\nThis bag remains in good vintage condition, showing minor, natural signs of gentle use. The canvas body is clean and vibrant, with only light surface wear. The leather trim has developed a warm patina and marks on the interior flap, adding character without detracting from its appeal. The gold-tone hardware is bright and functional, with slight hairline scratches consistent with careful handling. Interior suede lining is well-preserved, with light signs of use, maintaining overall cleanliness. Corners and edges show minimal rubbing, as seen in the detailed photos.\n\nDetails:\n\nBrand: Prada\n\nMaterial: Canvas with leather trim\n\nColor: Green/black stripes with tan leather and gold-tone hardware\n\nInterior: Beige suede lining with zip and slip compartments\n\nStrap: Detachable/adjustable fabric shoulder strap (not original strap)\n\nClosure: Magnetic snap flap\n\nMade in Italy\n\nIncludes: Original dust bag, authenticity card, and detachable strap (not original strap)\n\nMeasurements (approx.):\n\nWidth: 20 cm\n\nHeight: 14 cm\n\nDepth: 5 cm\n\nStrap drop: Adjustable 35 to 70 cm\n\nEstimated era: Early 2000s\n\nA versatile piece that blends casual elegance with signature Prada craftsmanship, this bag is perfect for everyday wear yet sophisticated enough to elevate any outfit.\n\n\n\nShipping: 25 Euro Worldwide Shipping with FedEx will include tracking number.\nExtra charges such as taxes or service fees may be added in the receiving country, the buyer will be responsible to pay those additional fees. Please check your import and custom fees before bidding.",
    "category": "handbags",
    "images": [
      "/public/demo/prada_green/prada_green1.png"
    ],
    "evidenceImages": [],
    "startPrice": 100,
    "bidStep": 10,
    "buyNowPrice": 500,
    "duration": 1440,
    "status": "active",
    "currentPrice": 100,
    "startTime": 1731540000000,
    "endTime": 1731626400000,
    "createdAt": 1731540000000,
    "isAuthentic": true,
    "brand": "Designer Brand",
    "era": "2000s",
    "numberOfItems": "1",
    "colour": "Black, Brown, Green",
    "material": "Leather",
    "condition": "Good condition, used with some signs of wear",
    "size": "Bags & Accessories / Mini, One size",
    "height": "14",
    "width": "20",
    "depth": "5"
  },
  {
    "id": "product_burberry_1",
    "sellerId": "seller_1",
    "title": "Burberry - Tote bag",
    "description": "Product Title: Burberry Tote bag\n\nCondition: This item is new and comes without original tags. While it has minor imperfections like slight stitching irregularities, light discoloration, or small marks, these shoes still retain their overall quality and style. Please review the pictures for more details on their condition.\n\nNote: Please take the time to carefully review the detailed images provided, as they highlight the unique features and condition of this exquisite item. Each photograph offers valuable insights into the craftsmanship, subtle details, and character that make this piece truly exceptional.\n\nDescription:\nElevate your style with the timeless sophistication of the Tote bag by Burberry. Meticulously crafted from the finest materials, this luxury bag effortlessly combines elegance and functionality, making it the perfect accessory for any discerning wardrobe.\n\nKey Features:\nMaterial: Expertly made from premium Leather, ensuring both durability and a sumptuous, luxurious finish.\nColor: Presented in a refined Red tone, designed to complement and enhance any ensemble with effortless grace.\nDesign: Thoughtfully structured with an elegant silhouette, offering ample space for your essentials while maintaining a sleek, polished look.\nDetails: Exquisite craftsmanship with high-end hardware, impeccable stitching, and signature touches that reflect the brand's dedication to luxury.",
    "category": "handbags",
    "images": [
      "/public/demo/tote_bag/tote_bag1.png"
    ],
    "evidenceImages": [],
    "startPrice": 100,
    "bidStep": 10,
    "buyNowPrice": 500,
    "duration": 1440,
    "status": "active",
    "currentPrice": 100,
    "startTime": 1731540000000,
    "endTime": 1731626400000,
    "createdAt": 1731540000000,
    "isAuthentic": true,
    "brand": "Burberry",
    "era": "After 2000s",
    "numberOfItems": "1",
    "colour": "Red",
    "material": "Leather",
    "condition": "New or as new, unused with or without original packaging",
    "size": "One size",
    "height": "30",
    "width": "33"
  },
  {
    "id": "product_valentino_1",
    "sellerId": "seller_1",
    "title": "Valentino - Black Leather Top Handle Bag - Handbag",
    "description": "Valentino Garavani – Black Leather Top Handle Bag\n\nElegant and structured, this Valentino Garavani top handle bag combines classic design with signature house elements. Crafted in finely textured black leather, the bag is adorned with gold-tone hardware.\n\nThe interior opens to one main compartment and an additional internal zip pocket. It is lined in black fabric and stamped with the gold Valentino Garavani logo. The bag closes securely with a folding buckle.\n\nFeatures:\n\nBrand: Valentino Garavani\n\nModel: Structured Top Handle Bag\n\nMaterial: Black textured leather\n\nHardware: Gold-tone\n\nClosure: Folding buckle\n\nInterior: 1 compartments, 1 zip pocket\n\nAccessories: Original dust bag\n\nOrigin: Italy\n\nMeasurements (approx.):\n\nHeight: 25 cm\n\nWidth: 31 cm\n\nDepth: 10 cm\n\nHandle drop: 12 cm\n\nA timeless Valentino piece ideal for both formal occasions and elegant everyday wear.\n\nCondition:\nThe Valentino Hand Bag is still in very good, used condition. The exterior black leather look great with only very light signs of previous use. The corners have almost no rubbing and look good. The handle is still firm. The interior is nice and clean with no damage.\nThe zipper works well. The gold-tone hardware still looks good and still has shine.\nOverall still in great condition with plenty of life left.\nComes with a dust-bag from Valentino Garavani. This item has no shoulder strap.\nPlease see the photos carefully for more details.\n\n\nShipping: 30 Euro Worldwide Shipping with FedEx will include tracking number.\nExtra charges such as taxes or service fees may be added in the receiving country, the buyer will be responsible to pay those additional fees. Please check your import and custom fees before bidding.",
    "category": "handbags",
    "images": [
      "/public/demo/valentino/valentino1.png"
    ],
    "evidenceImages": [],
    "startPrice": 100,
    "bidStep": 10,
    "buyNowPrice": 500,
    "duration": 1440,
    "status": "active",
    "currentPrice": 100,
    "startTime": 1731540000000,
    "endTime": 1731626400000,
    "createdAt": 1731540000000,
    "isAuthentic": true,
    "brand": "Valentino",
    "era": "After 2000s",
    "numberOfItems": "1",
    "colour": "Black",
    "material": "Leather",
    "condition": "Good condition, used with some signs of wear",
    "size": "Bags & Accessories / Medium",
    "height": "25",
    "width": "31",
    "depth": "10"
  }
]
